{
  "title": "24 January // Lecture 3",
  "cells": [
    {
      "type": "markdown",
      "data": "Increasing investment in the mortuary sphere (seems to map onto increased differentiation)\n\n(Insurance companies rule the world???)\n\nStable finance ~~ Economic Complexity\n\nAswan Dam in Nile: BAD\n\nEgyptian worldview: divinely and perennially maintained universe: renewal, unchanging desert, constancy of Nile, &c.\nRedlands, blacklands, divine realm, underworld interconnected in Egyptian mythology\n\nAncients found their deities in their world, the real world. Not separated on a different metaphysical plane\n\nDifferentiation in mortuary complexes may not map to wealth/status differentiation into hierarchy\n\nBottom up to get away from ideas of hierarchies\nLarge land-owning families were the backbone of Egypt\n\nLarge-scale building projects (esp. mortuary complexes) funneled from outskirts to center of society\n\nMortuary cult (perennial care of King to provide for him in afterlife)\n\nLate 4th millenium blacktop wares\nAccruing of burial goods (that may have to do with material status, but could be more complex)\nBurnished surface, handbuilt\n\nCommittee established ownership of ancient culture; invasion of burial sites only problematic with indigenous cultures\n\nSymmetry?\nBuildings look symmetrical but aren't\nLiturgy: buildings used for certain purposes, which shapes the layout of the building\nMeeting of routes with entrances creates distorting angles\nBuilding in ancient Egypt is closer to sculpture: practice, process more important than finished product\n    Conceptual art: Having done something, not the actual thing done\n\nKhafra/Khufu's statues reached up to 150m\n\nMortuary cult provided for the King in the living world (*ka*)\n**Opotropaic:** protective from evil\n*Ka* needs to be fed in order to keep it alive so it can be sent to join the divinities\nRedundancy is important aspect of Egyptian art; create redundant images or places to promote or protect the physicality of the *ka*\n*Ba* is closer to divine aspect\n*Akh* is another aspect; like the ascended *ba*"
    }
  ]
}