{
  "title": "23 October // Puzzles Sheet",
  "cells": [
    {
      "type": "latex",
      "language": "latex",
      "data": "1. The parity of black pebbles is unchanged by our actions; additionally, the number of pebbles decreases by one at every single step. Thus for the last remaining pebble to be black, the original number of black pebbles must also be odd: $\\Pr(L=B) = \\Pr(B = 1 \\mod 2) = \\frac{1}{2}$\n\n2. We distribute the 10 black pebbles evenly, one per bag. Then pack the 10 white pebbles into a single bag. The chances we win are thus $\\frac{9}{10} + \\frac{1}{10}\\frac{1}{11} = \\frac{9}{10} + \\frac{1}{110} = \\frac{100}{110}$\n\n4. We cannot improve our odds by calling, \"Next.\" Change the game: Imagine \"Next\" flips the bottom card; in fact, the odds that it is black are the same as the odds that the top card is black. Thus we do best by never saying \"Next\" (50-50).\n\n5. The last person uses their guess to announce the parity of black hats; subsequent persons can determine precisely what color their hats are. The first person is only wrong half the time.\n\n7. For 3 people: pass if see different hats; guess opposite if see same hats. $\\Pr = \\frac{6}{8} = \\frac{3}{4}$.\n\nFor $n$: we have $2^n$ binary strings encoding the results. Construct the bit string with an unknown value for their hat. $L \\subseteq \\{0,1\\}^n$, $W$ is all neighbors of $L$ by a single bit flip. Pick choice in $W$ if possible, otherwise pass. Win $\\Pr = \\frac{\\mid W \\mid}{2^n}$.\n\nThen we pick $L$ to maximize the cardinality of $W$. Choose each string with probability $p = \\frac{\\lg{n}}{n} \\implies E[\\mid L \\mid] = p2^n = \\frac{2^n\\lg{n}}{n}$. We add to $L$ any string 2 or more flips from any string in $L$. $\\Pr(\\alpha \\in L) = (1-p)^{n+1}2^n \\le e^{-np}2^n = \\frac{2^n}{n}$. Thus $\\mid L \\mid \\le 2^n \\frac{\\lg{n+1}}{n}$ (tends to 0 in the limit).\n\n9. By both guessing (same as flip) or (opposite of flip), we both are right with $\\Pr = \\frac{1}{2}$ (and both wrong symmetrically). The expected gain is then $1.5 \\gt 1$.\n\n10. For envelopes of $x$ and $2x$ dollars, the expected amount of a random choice is $\\frac{1}{2}x + \\frac{1}{2}2x = \\frac{3}{2}x$. The expected gain from switching is as follows. With probability of $\\frac{1}{2}$ I choose $x$ dollars; then I gain $x$ by switching. Symmetrically, with probability $\\frac{1}{2}$ I choose $2x$ dollars and lose $x$ by switching. The net is 0, and so the expected gain is none.\n\n11. Abel's best choice is to miss??\n\n12. The situtation of $n$ passengers is unchanged from the situation of 2 passengers: We can change the game such that everyone gets their seat except the first guy, who get's his seat with probability $\\Pr = \\frac{1}{2}$, so we find our seat with $1-\\Pr = \\frac{1}{2}$"
    }
  ]
}