{
  "title": "14 févr. // Lecture 6",
  "cells": [
    {
      "type": "markdown",
      "data": "### Terminer L'évolution du surréalisme\n\n- André Breton, \"pape\" du surréalisme, prononciateur des excommunications\n- il veut que le mouvement ait une côté politique afin de transformer le monde et changer la vie\n- en tant que mouvement artistique, le surr. s'élarge vers la politique et devient le moyen du révolution, le communisme y compris\n- problème de communication entre l'art et le langage politique\n- se rappeler : __Minotaure__\n- Grand agitation politique\n    - Fascisme en Italie, l'extrême droit se manifeste contre le peur anti-parliamentaire\n- Les surr. se joingent à la communauté de vigilance des intellectuels anti-fascistes \n- l'Expo int'l. de surr. était particulier : Breton refuse que ce soit un reflectif ? Il faut que ce soit un création, que ce soit un expérience de vivre pour les visiteurs\n    - en opposition à la tradition\n    - créer un dépaysement, un bouleversement\n    - dicto. abrégé du surr.\n    - la presse : le dernier ? ou bien, est-ce que ce charactère sombre ...?\n- 1939/40 : Breton et qqn d'autre s'exile aux EU, marquant la fin du surr.\n\n# Panorama de l'entre-deux-guerres\n\n- une réaction à la première guerre avant de tomber dans une autre\n- rechere à la litt. de belle époque\n- répondre à une société qui se glisse vers une société qui ...?\n\n## I Quelques grandes figures et tendances du roman\n\n### André Gide\n\n- le premier de mettre la mise en abyme (le roman qui fait le récit de sa propre gestation)\n> J'écris *Paludes*\n\n### Roman et société dans l'entre-deux-guerres (Les romans-fleuves)\n\n- roman individualiste cèdent la place au mouvement social, des romans de classe\n    - ex: *Les Thibault*, famille bourgeoisie, questions entre les frères, révolté vs. conformisme\n    - est-ce que la bourgeoisie va prendre sa reponsabilité ?\n\n### Le roman en quête de morales\n\n- reliés à la religion\n- André Malraux : questionnement du sens qu'on donne à sa vie, &c.\n- *L'Espoir* pose des questions éthiques et politiques (héroïsme, sacrifice, martyr, colonialisme, communisme, fascisme, engagement)\n- Céline\n\n## Le théâtre : Du Boulevard au théâtre d'auteurs\n\nà lire\n\n# La litt. durant la 2de Guerre mondiale : Collaboration et résistances litt.\n\n- la résistance litt., la poésie de la résistance\n\n### Histoire de la guerre\n\n- la déclaration de la guerre '39, drôle de guerre, n'est pas attaqué dans l'hiver\n- l'armée française vaincue dans 6 semaines, Paris prise\n- l'Exode : toutes les gens qui partent sur les routes\n- condition d'armistice\n    - Nord/Ouest occupé directement\n    - la moitié Sud : gouvernement Vichy, ou s'installe les pouvoirs politique\n\n### La production litt. sous contrôle\n\n- papier contrôlé : premier utilisé pour la propagande\n- déséquilibre de la demande des livres drastique\n- opposition entre ce que vont imposer les Nazis et la qualité de certains oeuvres\n- Otto : liste de livres indésirables (interdit par la politique Nazi, ex. juif)\n    - 2 milles tonnes de livres qui disparaissent, saisis\n    - un comité de censure, notamment des écrivains juifs\n    - Max Jacob, peintre/poète, il est arrêté par le gestapo et meure en 1944\n- en tant que francophile/phone, chargé avec les relations avec les intellectuels français\n- ils se soumettent au pouvoir Nazi\n- Pierre Drieu la Rochelle : nouveau directeur de NRF (grande maison d'édition)\n- *Gilles* donne une histoire politique et intellectuelle d'entre les deux guerres\n    - il dénonce la décadance, tenant responable les intellectuels, la classe bourgeoisie\n    - face à la faiblesse de la democratie, une critique\n- Oct. 1941 : cérémonie officielle, délégation d'intellectuels qui part en voyage à Nuremburg\n    - y compris Rochelle, Brasillach, Fernandes\n- 1944 fermeture de NRF (1953 rouverture, NNRF)\n- collaborationnistes qui font de propagande, qui adhèrent à ce que propose le régime Nazi\n    - l'extrême droit\n    - suprémacie, élites\n    - FN responsable de l'affaiblissement (morale, économique, &c.)\n    - considèrent que les écrivains sont aussi responsable de cette dissolution de la France et de ces valeurs\n    - *Bagatelles pour un massacre*, *Ecole pour les cadavres*, *De baudra*? (Céline? anti-juifs) polémiques\n- Brasillach\n    - extrême droit, intellectuel\n    - *Notre avant-guerre*\n    - redresse sa jeunesse, son enthousiasme, ...?\n    - approuve des idées nazies\n    - executé pendant l'écuration\n    - responabilité de l'écrivain : peut sa politique mériter sa mort ?\n    - la peine de mort\n- série d'écrivains qui acceptent de publier dans les journaux (ne pas attaquer les Nazis, mais pas ouvertement de leur côté)\n    - ouvert les questions des écrivains pendant l'occupation\n    - nouveaux noms, admis tant qu'il n'y ait pas d'attaque direct ou prise de position sur la guerre\n- par contre, d'autres qui ont choisi ou le silence ou la résistance\n\n### La poésie en résistance\n\n- une résistance qui se loge dans l'intérieur, une résistance ouverte et clandestine\n- *Les Editions de minuit*\n    - Jean Bruller\n    - Premiers titres en 1942\n    - Vercours, lui-même non pas écrivain, écrit *Le silence de la mer*\n    - Louis Aragon (François la Colère) ; Paul Eluard (Jean le Ho?)\n    - *L'Honneur des poètes* : collection de la résistance, dont Eluard est responsable pour la publication\n    - Eluard : Liberté, RAF l'a parachutée partout en France\n    - Desnos, pacifiste, appèle pour revolte contre Hitler\n    - 1945, Benjamin Perré, publie un essai assez violent *Le Déshonneur des poètes*\n        - est-ce que la litt. doit s'engager ?"
    }
  ]
}