{
  "title": "22 August // Lecture 1",
  "cells": [
    {
      "type": "markdown",
      "data": "# Language and Communication\n\nDean Pettit\nCaldwell 215A\n\nOffice Hrs: TTh 1-2 or by appt\n\n## What is the course about?\n\nThe nature and structure of human language\n\nUse animal language as a vehicle for what is unique about human language\n\nEventually: how could it have evolved?\n\n## Human Language\n\n- pervasive part of daily life\n- take it for granted; don't appreciate it\n- **the miracle slide**\n- Series of noises made by the human vocal apparatus; that exact sequence encodes and communicates potentially infinite possibilites\n- Ideas are very specific, but the subject is not close at hand, not even necessarily true (compare to child: difficulty understanding *history*, *sarcasm*, *abstract*, *ideals*)\n\n### How does language encode thought?\n\nLanguages have elements (words, symbols, gestures, inflection, &c.): examine their relationship\n - This is referential theory\n \nGrammar/Generative Grammar\n\nMapping to visual association? Sure, but it's not 1-to-1, and what about ideals?\n\nMapping to sensory stimuli (touch, noise, &c.)... or feelings?\n\nPhonology/Phonetics: phonemes\n\nWord boundaries are distinguishable to competent speakers: brains -> words -> grouping -> ears -> brains -> separate words\n\n### Human language is a discrete combinatorial system\n\n- Multiple levels of organization\n  - Speech sounds\n  - Words\n  - Complex phrases\n\n1. Phonology (sounds and syllables of words)\n2. Morphology (individual pieces of words, e.g. prefixes and suffixes)\n3. Syntax ($\\star$) (word order)\n4. Semantics (meaning)\n\nContrast with animal communication (not systematically recombining discrete elements)\n\n**Bee Dance**\n\nConvey information to hives about quality of food, distance, location, &c., but it'a analagous (angle of dance, length)\nMore information than primates (more typically alarm calls in e.g. birds)\n\n### How can languages differ?\n\nExpressive potential?\nWord order?\nConnotation?\nDifferences in underlying patterns of thought?\n\n### Origin of Language\n\nGenetic mutation?\n\nCould it have started more anagolously, or with direct concrete connection?\nNecessity for survival: grouping is stronger, only possible with communication (Natural Selection)\n- Leopard pelt connects to (or really *is*, without distinction from) physical animal?\n  - Early stage on the way to full blown language (called Protolanguage)\n\nPassed down through social structures as a mechanism of cultural transmission\n\nCould the early origins of language be less biological: gestural protolanguage?\n\nWhat about cave paintings? Indirect indication of cognitive capacities, esp. for symbolic abstraction\n\n# Next Class\n\nCh 1/2 Pinker\n\nThoughts--not necessarily biological phenomenon\n\nWhat about a cultural innovation or invention? Probably wrongheaded.\n\nHuman psychology and cognition to the rescue\nSubsystem alongside motor, visual, &c. w/ a distinctive organization; underlies the structure of every and all language\n\"Universal Grammar\""
    }
  ]
}