{
  "title": "28 November // Lecture 25",
  "cells": [
    {
      "type": "markdown",
      "data": "# Language Evolution\n1. Is language a biological phenomenon?\n    - It's not an invention (e.g. automobiles)\n    - It's not learned\n2. Why should we consider its origin as evolutionary?\n3. Is the evolution of language an empirally tractable problem?\n    - We can't appeal to the fossil record (due to Rapid Fading)\n    - Requires cross-discipline insights and methodologies\n    - Neither a linguist or biologist is good at the other\n\n## Human Language\nDifferent from any other ACS\nDiscrete Combinatorial System\nInnate faculty, must have emerged early in our species life\n\nHow?\n\n**READ Howser, Chomsky, & Fitch**\n\nHCF's Hypothesis: part of the system is new, and part may be borrowed\n\n### Backrground on Darwin\nCredited with theory of evolution\n*Actually* developed theory of Natural Selection\n- Mechanism of evolution\n- No one in Darwin's age questioned that evolution occurred\n\nBased in part on observations about breeding of domestic animals\n\n### Natural Selection\n3 Components:\n- Variation\n- Differential Survival\n- Inheritance\n\nDarwin hypothesized that natural selection acts gradually to adapt extant traits\n\n### Varieties of Selection\n**Sexual Selection**\n- competition among sexes leads to certain traits being inherited\n**Kin Selection (Altruism)**\n- certain traits, like taking increased risk, don't seem to contribute to individual survival; they do contribute to survival of genes\n**Group Selection**\n- deals with unit of selection (think e.g. wolf packs, bee colonies, social organization like dolphins)\n- problematic: no inheritance of traits (at least, not reproductively)\n\n## Testing Evolutionary Hypotheses\n*Historical explanations*--they make claims about the selective history of a trait\nCalls for *historical evidence*\n\nBut remember, language doesn't fossilize! Nor do other cognitive abilities\nSo how do we test?\n\n### Homologous vs. Analogous Traits\n**Homologous** traits--related by descent from a common ancestor's trait\n**Analogous** traits--emerged independently in two separate lineages\n- this can tell us about the biologically possible solutions to a particular problem\n\n### Comparative Method\nWe can infer from H traits information about their last common ancestor\n- This gives us some evidence independent of the fossil record\n\n### Adaptation vs. Exaptation\n**Adaptations** are adapted for a particular function by selection\n**Exaptations** originally served one function but now server another due to selective pressure\n**Spandrel**--*byproduct* of adaptive selection for another trait"
    }
  ]
}