{
  "title": "7 févr. // Lecture 5",
  "cells": [
    {
      "type": "markdown",
      "data": "### (cont) De Dada au surréalisme\n\nEst-ce que Dada est seulement nihiliste, ou est-ce également une force poétique ?\n\n- revue __Littérature__ (Breton, Aragon, Soupault) (1919)\n- premiers essais de l'écriture comme automatique, experimentale\n- prose : __Les Champs magnétiques__\n- les quatres (3 poètes au-dessus, Tristan Tzara: Dada) se rencontrent à Paris et commencent une recherche commune\n- après ce court compagnage, 1922, rupture avec Dada (qu'ils ont trouvé être répétitif ?)\n- Dada n'est pas qu'une idée de négation ; il est aussi féconde\n\n### La fondation du surréalisme\n\n- a partir de cette démarche destructrice, Breton et les autres vont essayer à construire un démarche constructive\n- (1917) Origine du nom : pièce d'Apollinaire, sous-titre « drame surréaliste »\n    - il faut liberer la pensé de ce qu'il a contrainte : la logique, la raison, la morale, le bon goût qui limites les productions d'art\n    - on pourra plus librement explorer et exprimer notre esprit psychique\n    - gisement poétique\n    - comment attendre cette source de poèsie ?brute?\n- Breton, médecin pendant GM1, intéressé par Freud\n    - il veut tirer un fruit poétique\n- Desnos, hypnose (explorer et liberer l'inconscient)\n- remise en question du sujet\n- Breton voulait structurer le surréalisme\n    - __Manifeste__\n    - consideré chef/fondateur, *mais* il ne l'invente pas\n    - l'écriture automatique : dictée de la pensée, en l'absence de tout contrôle exercé par la raison, en dehors de toute préoccupation esthétique ou morale\n    - l'évolution de l'imaginaire attend une surréalité\n    - explorer toutes les réalités humaines\n    - l'imagination\n        - anti-rationaliste\n        - il faut la retrouver telle que celle de l'enfance contre toutes les necessités quotidienne, tous les impératifs utils\n        - une qui ne pardonne pas, qui ne trompe pas\n        - un champs des possibles\n        - au-delà d'un construction esthétique\n        - redefinir l'idée d'être humaine\n    - le rêve\n        - Freud\n        - une parte très importante de la vie : il n'est pas de temps perdu\n        - va s'exprimer d'une façon toute à fait libre\n        - le *lieu* d'expression libre *mais également* une experience vécu, nous avons les émotions là-dedans\n        - il faut abattre la frontière qu'on a mise entre le rêve et la réalité\n    - l'image poétique\n        - « une création pure de l'esprit »\n        - rapprochement des deux réalités éloignées\n        - c'est le choque y produit qui crée un image poétique\n        - l'écriture automatique, rapide sans penser à forme, va nous donner des oeuvre complètement inattendues\n        - métaphore luminieuse\n        - métaphysique de l'image, qui fait l'énergie de l'existence nouvelle\n        - un univers parallèl\n- après ce manifeste, la __Littérature__ devient __La Révolution surréaliste__ qui contient des idées, oeuvres, et analyses surréalistes\n    - textes à propos de suicide\n    - une revue qui chercher à ouvrir le débat\n    - les lettres à qqn\n        - pose la question de folie\n        - la vision des fous se voient non pas comme disfonctionnement mais comme une inadaptation à la réalité\n        - les fous sont les forças de la sensibilité exacerbé\n    - reproduction de peintures, de photos, &c.\n- les femmes tiennent une place inspiratrice\n- Bureau de Recherches surréalistes : centrale dans laquelle des poètes et la publique peuvent entrer et essayer de produire des oeuvres collectifs\n- __Nadja__\n    - Nadja est schizophrène\n    - narrateur raconte des événements quotidiens pendant les 9 jours passé ensemble\n    - dedans, Breton nous montre le surréalisme comme mode de vie\n    - dans les rues de Paris\n    - attention très forte aux signes, un témoins ?à gard?\n    - la rencontre avec Nadja est un fait précipice qui les lancent sur un exploration de rêves\n    - traverser le mirroir qui l'amène de l'autre côté de la réalité\n    - Breton a introduit la photographie dans les pages\n- __Le Paysan de Paris__ d'Aragon\n    - un promenade dans les rues\n    - saisir le sentiment de la nature\n    - de plus, le merveilleux quotidien\n    - préface à une mythodolgie moderne à travers son passage dans la ville\n    - rehabiliter le concret comme mode de connaissance\n    - « toues les erreurs des senses correspondent des fleurs étrangères de la raison »\n- __L'Amour la poésie__ d'Eluard\n    - devient symbole de la possibilité de l'image surréaliste\n    - « La terre est bleu comme un orange, jamais une erreur, les mots ne mentent pas »\n- __La Femme 100 têtes__ d'Ernst (roman-collage)\n    - histoire en image\n    - les fragments de plusieurs sources qui apportent une réalité nouvelle\n    - combinaison inédite, assez bizzare\n- __Un chien dans le nue__ (court-métrage)\n\n### L'évolution du surréalisme\n\n- __La Révolution__ se renom (__Le Surr. au service de la Rév.__)\n- Breton, __Second Manifeste__\n- il ne veut que le surr. soit seulement artistique\n- Partie communiste : le moyen d'un project politique plus large\n- Les surr. n'arrive pas à s'entendre avec PC (qui condamne Trotskyisme)\n- Breton est exclus de PC\n- __Le Surr.__ devient __La Revue minotaure__, recentrée sur la litt. et l'art"
    }
  ]
}