{
  "title": "2 February // Lecture 6",
  "cells": [
    {
      "type": "markdown",
      "data": "Southern/Upper Egyptian state (Hierankopolis to Abydos) unites the Egyptian state at some point (early)\nSaqqara also has tombs with the same king names as those near Abydos... Hm...\n\n?royal seat? at El-Amarna by one king: correspondence there gives clear picture of New Kingdom\nEarliest state-level societies in near east (Mesopotamia, Nile, &c.) developed complex city-state societies in $3000$ B.C. and only later has more unified state ($2000$ B.C.) EXCEPT Egypt: they did it as early as $3000$ B.C.\n\nAcadian period of unification: Most city-states rejected the idea of unification depsite going along.\nSimilar to USA federal rights vs. state rights\n\nTop-down structures always unstable\n\nEgyptian's isolation possibly connected to development of territorial borders: didn't need to negotiate with others.\nEnvironment may be connected to the skipping of the city-state structure--other city states simply expand, meet neighbors, and then there's war. Egypt didn't quit have that same background. Egypt probably didn't have cities on the same scale as the East. They had temples, necropolises, and villages.\n\nReplication of Burial Sites (esp. named Kings) might have contributed to unification? More could give offerings, &c. Would have expressed an Egyptian identity. The rituals create integrated communities, and on the scale of the king contributes to the national idenity as a kingdom. So the mortuary complex became central to the kingom's unification and identity.\n\nIntegration of cults leads to combination of Osiris/Horus (Southern) and Ra (Northern).\n\nMudbrick mastabas abandoned for massive stone-step pyramids around $3^{rd}$ century\n\nImportance of divine kingship embedded in Egyptian culture... what is it?\nPossibly tied into keeping the Sun coming back (Ra) which is the source of their live\nCosmic order important (not just in heavens or land; *total* universal order): called *ma'at*, which later becomes synonymous with law.\nShe (ma'at) is stability and constancy in the universe, and somehow the king became elevated to the custodian of said cosmic order. This includes the Sun cycle, the regular inundation of the Nile, and more.\n\nMesopotamia has very different river-culture: drought or irregular catastrophic flood--culture of death, destruction, &c."
    }
  ]
}