{
  "title": "15 November // Lecture 25",
  "cells": [
    {
      "type": "markdown",
      "data": "# Putting it all together\n\n### Read-Only Memory\nBasically just a lookup table\nA multiplexer can implement one:\n- $2^n$ input mux for $n$-input function\n- $n$ bit select input is now address of data being accessed\nLimitation: 10-bit address is a really bit mux\nWe'd also like to write to memory!\n\n### Mux's Guts: Decoder + Selector\nThe Decoder identifies the desired input (generates all possible permutations of input)\nThe Selector enables that input on the output\n\nWhat if we could share the Decoder logic?\n\nWe build a ROM out of a general-purpose lookup-table, from which we can impolement any truth table and thus, any combinational device\n\n### Rom Tech\n- Mask (old) ROM\n- Fuses (old) PROM, was programmable\n- Erasable EPROM\n- Electrically erasable EEPROM (Flash!)\n\nMemory has $2^n$ locations times outputs for $n$-bit addresses\n\n### Read-Write RAM\nDynamic RAM uses analog storage\n- encodes info using voltage\n- we can store a voltage as charge on a capacitor\n\nPros: compact!\nCons: leaky, complex, destructive reading, not digital\n\nStatic RAM uses a mux an feedback (no longer combinational, but digital storage)\n\n### Static D Latch\nWe create a stable latch that will hold data while our selector is inactive; otherwise, it follows data input\nPositive latch vs. Negative latch\n\n### Latch Timing\nGuarantee that inputs are valid and stable during period when they chage state\nWe have a pulse width, setup time, and hold time\n*setup time* -- the data has been setup properly before the latch begins to close\n*pulse time* -- how long latch is active to receive new data\n*hold time* -- the data should hold after the closure of the gate\n\n## Transparency\nWe need our data to not get squished together\nWe double gate it\n\n### D Flip-Flop\nLogical \"escapement\"\nClock upticks allow changes of data, so it appears to trigger them\n\n### Flip Flop timing\n**propagation delay** -- max delay allowed between changes of data\n**setupt** -- data must arrive within a certain time\n**hold** -- data must hold after the clock tick"
    }
  ]
}