{
  "title": "12 January // Introduction",
  "cells": [
    {
      "type": "markdown",
      "data": "#Clar 50H: Art in the Ancient City\nProfessor Donald Haggis\n\n| Term                       | Defintion                                                                                           |\n| -------------------------- | --------------------------------------------------------------------------------------------------- |\n| *Material Culture*         | Physical and material expression of societies that created cities                                   |\n| *Culture History Approach* | Define the material in terms of some cultural definition                                            |\n| *Archaeology*              | Uncover artifacts to understand historical cultures; basic components and patterns of human history |\n| *Techné*                   | Highly-specialized craft; series of learned behaviours; is it art?                                  |\n\nExamine three complex mediterranean societies; comparative\n\n###Ex: Athens\n- Ancient city\n- Athens burned by Persian invaders (circa 480 B.C.)\n- Dating of burned sections by archaeologists \"proves\" historians correct (why dig any further?)\n- Archaeologists say \"So what?\": How much burned, how quickly reoccupied, responses to burning, where to go?\n- Historians have top-level view of events; Archaeologists get more into the lives of the people, the details (interested in more than just benchmark points)\n\n##Why is it Important?\n(Prof. Haggis goes on long tangent of \"What is archaeology?\")\n\nWhat is *Greek*? Or any other culture?\nWhat is *art*? Function, purpose? Response? Did it exist at all in antiquity?\n\nAncient crafts were part of life; because of today's perceptions, we qualify them as art, but they were technical production skills (techné)\nAny artifact can be part of the technology of the era; doesn't imply that the culture viewed it as art\n\n###Some Discussion Points\n- Production of art and craft\n- Consumption of art and craft"
    }
  ]
}