{
  "title": "Fall Planning // Leah’s 1st Email ",
  "cells": [
    {
      "type": "markdown",
      "data": "Hello, incoming L-Team! \n\nFirst of all, congratulations! I am so excited to work with all of you.\n\nThis E-mail is long, but please bear with me. Our first week back is busy!\n\n\n\n## Fall Planning, August 17\n\nWe will have our planning retreat for fall semester on August 17th. We will go through the calendar, talk about our hopes/plans for the year, and share a meal together! \n\n1. Please come prepared with a program idea. Each L-team member leads one program a semester. Each topic should have some theological connection or a biblical reference to be the bedrock of what we are discussing given our vision of fostering Christian ministry. Program ideas may evolve, but it's hugely helpful if each person has a starting point. (Also, remember that no one is an expert here, so do not be intimidated!) \n\n2. Please also think about your individual position and bring any questions or ideas you may have. Consider if there are ways you want to have some impression on the way the position looks. While there are expectations that come with each position, there is also flexibility! \n\n3. If your professors have released syllabi by the time of the retreat, it may be helpful to have put important dates (tests, etc.) in your calendar. We will pick dates for programs so it is helpful to know when you may have a particularly stressful week. \n\n\n\n## Week of Welcome\n\nHere is what our first week will look like: \n\n### Planning retreat on *August 17th*\n\nWe will need people to go to both services on *August 19th and 26th* (the first two Sundays of the semester). We will have a table set up outside to greet new students and make sure they know about PCM. \n\n### *August 19th* is Fall Fest.\n\nOn *August 20th* we have the CMA student leadership event 11:00-1:00. At this event, the leaders from each member of our campus ministry association come together for a meal to talk about how we do things and meet people in similar positions etc. \n\nAlso on *August 20th* we have ice cream social at 4:00. It will probably run for about half an hour or so. This is a chance for people interested in PCM to come learn more about us. \n\n*August 22nd* is Oldie Goldie. This event gives returning PCMers a chance to talk about our summers/catch up so that we can engage with newcomers at the first PCM. \n\n*August 23rd* will be our first program. \n\n\n\nWe hope that L-team will go to everything possible! If you need to miss an L-team meeting, Thursday night, or retreat, please talk to me and to John. We appreciate that you have made this commitment, and feel that it is important for us to attend the things that we are supporting as a team. Of course, we understand that conflicts will come up, but communication and advance notice (when possible) just make it easier.\n\nIf you have any questions about your position or L-team in general, please don't hesitate to reach out! If anyone does not have my number, it is (336)413-2423. \n\nThank you all so much for agreeing to give your time and talents to this team. And for reading this whole E-mail. \n\nHAGS!"
    }
  ]
}