{
  "title": "12 October // Lecture 15",
  "cells": [
    {
      "type": "markdown",
      "data": "# Semantics\n\n## Theories of Meaning\n\n### Meaning of 'Meaning'\n\nLiteral definitions, implied context, &c.\n\nWord-object association, Plato's ideal?\n\nWhat about the meaning of phrases? (\"John means such and such by his remark...\")\n- Thought had and expressed by John behind speech sounds?\n\nIn other words: what is meaning?\n\n### Theory of Meaning\n\nAttempts to answer this question\nYou know it when you see it, but it's difficult to define\n\n2 questions:\n1. What is it that makes speech meaningful--what is distinctive of things that have meaning?\n2. What gives a word or phrase the particular meaning it has--what distinguishes the meaning of one word or phrase from another?\n\n### Referential Theory of Meaning\n\nWords or phrases are meaningful by referring to things\nMeaning of expression is the thing it refers to; it is *reference*\n\n**Problems**\n\nWord-arrangement is part of meaning...\n\nIt's hard to define what some words refer to: e.g., \"of\", other prepositions, \"nothing\", &c.\n\n### Ideational Theories\n\nIdeas as Images\n\nCommunication of ideas--misunderstood? (Frege): Publicity. Meaning must be public in some sense\nDog: mental idea too specific\n\nIdeas as Concepts\n\nObjections:\n- Concepts are too language-like; ideas not sufficiently abstract\n- Some words don't have images (\"of\", &c.)\n- Publicity\n- Meaningful sentences exist that express ideas or thoughts that have never before existed in anyone's mind\n\n## Speaker Meaning vs. Sentence Meaning\n\n1. What did Smith mean?\n2. What doest that sentence mean?\n\nThey come apart when:\n1. Context Dependence (\"This is a fine red one.\")\n2. Misunderstanding (\"begs the question\")\n3. Irony/Implicature (\"That was a nice movie.\")\n\n**Grice**: Psychological Theory of Meaning\n\n- Sentence Meaning: A sentence comes to mean something because speakers conventionally mean something by it\n- Speaker Meaning: A speaker means something by a sentence when the intend to communicate something by uttering it\n\n### Natural vs. Non-natural\n\n**Natural**\n1. Those dark clouds mean rain\n2. The impasse in congress means there will be no healthcare reform\n3. Red litmus paper means acid\n\n**Non-natural**\n1. That remark (\"you don't have to go home, but you can't stay here\") meant that we should leave\n2. That gesture meant that there was a foul\n\nDifferent *Entailments*\nNatural: Factive, nothing meant by the meaning, no paraphrase, \"the fact that\"\nNon-natural: Not factive, something was meant by the meaning, by somebody, paraphrase"
    }
  ]
}