{
  "title": "17 April // Lecture 23",
  "cells": [
    {
      "type": "markdown",
      "data": "Poll Ev\n\n> Q: Shortest path from A to F (cheapest)? [refs a diagram]\n> A: 8 (other)\n\n> Q: For unweighted digraph, repeat:\n> A: 3\n\n> Q: True or False: Consider any two arbitrary planar graphs $G_1$ and $G_2$ (the image is an example with 2 specific graphs). We add an edge $(v_1,v_2)$ between some $v_1 \\in G_1$ and some $v_2 \\in G_2$, connecting the two graphs. The resulting graph is still planar, no matter which planar graphs and vertices we choose.\n> A: ...did not decide\n\n> Q: True or False: Consider these two digraphs G1 and G2. G1 and G2 are isomorphic... that is, the same nodes and edges other than labeling. [refs a diagram]\n> A: True\n\nEuler was a genius\n\n# Königsberg bridge crossing problem\nEuler modeled it with an undirected graph\nWant to know if we can walk across each bridge only once (trace each edge once)\n\n**Euler Path** is a path in the graph passes through every edge once\n**Euler Circuit** is an Euler path that begins and ends on the same vertex\n**Degree of vertex** is number of edges touching a vertex\n\nTheorems:\n1. If the graph has any odd vertices, no EC. If the graph has all even vertices, at least one EC.\n2. More than 2 odd vertices, no EP. Exactly 2 odd vertices, at least one EP starting on one and ending on the other\n3. The sum of the degrees of all vertices is even (twice $\\lvert E \\rvert$). The number of odd vertices is even\n\nNot constructive: it can verify existence but not construct\n\n## Algorithm\nWorst case linear time\nYou can see the powerpoint or the book for the algorithm (we aren't going over it in class)\n\nTopology...\n\n# Hamiltonian Paths/Circuits\n**Hamiltonian Path** is a path in the graph that passes through every *vertex* once\nSimilarly, a **Hamiltonian Circuit** is a Hamiltonian Path that ends where it starts\n\nIcosian game is a game based on this type of circuit (for which one exists!)\n\n5 Platonic solids that produce Hamiltonian Graphs\n(d20, d12, d8, d6, d4): See ppt\n\n## Algorithms and theorems for Hamiltonian Graphs\nHarder, for some reason\nSufficient conditions:\n- Dirac (1952): simple graph with $N$ vertices is H. if degree of each vertex $\\ge \\frac N 2$\n- Ore (1960): \"\" if for every pair of non-adjacent vertices the sum of their degrees is $\\ge N$\n\n# P vs NP\nNo *known* efficient algorithm for finding HP/HC\nEP/EC is linear worst case\n\n\"Efficient\" means polynomial (even $n^2$, compared to $2^n$)\n\nWe have *not* yet ruled out the existence of such an efficient algorithm\n\nWe can easily *verify* a given path/circuit as H. or not\n\nTraveling Salesman Problem"
    }
  ]
}