{
  "title": "7 mars // Lecture 7",
  "cells": [
    {
      "type": "markdown",
      "data": "## Corrigé dissertation\n\n> Je vais à l'aventure quand j'ecris un livre. Mais par la suite, tout se regroupe et forme un ensemble. En général, le prétexte, le sujet, est minuscule au départ.\n\n-- M.D. 1963\n\n__Paradoxe__\nécriture spontanée, hasardeuse $\\to$ au même temps, cohérent\nanalogie voyage $\\to$ écriture, *Marin de Gibraltar* : imprévu, la découverte (but de voyage)\nvoyage sans déstination\n\n__Prétexte miniscule__\nle processus d'écriture qui importe\namplification\n\nDuras commente sa pratique d'écr.\n2 élém. importants--paradoxe, amplification (prétexte min. qui nous donne un roman entier)\n\n### En quoi cette double caractérisation peut-elle rendre compte du *Marin de Gibraltar* ?\n\nI) __Une structure cohérente__\n1. Importance de « l'aventure » dans *Marin de Gibraltar*\n    - rencontres au hasard (chauffeur, Anna, « une chance sur mille » 123, 128, + 116, 121, 364)\n    - Anna a rencontré par hasard le marin\n    - $\\to$ voyages (Sète au Cotobou? au Léopoldville au Caraïbe)\n    - matérialisation hasard par messages $\\to$ aventure qui donne au récit sa strucutre du voyage\n\nLa cohérence du roman lui vient également à ce qu'il est un sujet miniscule qui s'amplifie\n\n2. Amplification\n    - brouillons app. génétique\n    - hist. marin minuscule (3 récits d'Anna qui contient quasiment rien)\n    - $\\to$ \"Parfois j'ai l'impression qu'il y a 10 histoires du marin\"\n    - en générer 2 autres (Epam., Gigi), presque mythique, apothéose\n    - hist. koudou $\\to$ \"interminable\", \"bourbier\"\n    - petit voyage sur terre qui devient voyage dans le monde entier (amplification)\n\nComment ce processus d'amplification démesuré peut-il donner une forme et une cohérence au roman ?\n\nII) __Le *MG*, un ensemble cohérent ?__\n1. Le narrateur, instance d'organisation\n    - narrateur, 1ère personne, masculin, sans nom, qui prend en charge le récit\n        - rassembler toutes les histoires\n        - il soolicite le récit\n        - il lance la nouvelle histoire (koudou) (chef d'orchestre)\n    - pour autant, narrateur peu fiable\n        - origine problématique\n        - incises\n        - il chosit quoi raconter (paroles rapportées ou non)\n2. Chez Duras, la réflexion sur la narration est structurante\n    - ce qui structure le roman et lui donne sa cohérence, cette écr. qui se cherche et se trouve avec difficulté\n        - qui ne cache pas ses errances\n        - énorme préambule, alors pas miniscule, est-ce déstructuration ? (difficulté du roman de se démarrer)\n        - écr. ver l'émancipation (trouver son écr., sa voix, sa voie)\n\nNarrateur qui met en scène ses propres difficultés mais qui continue à écrire est partout chez Duras\n\n# *L'Amant* : Roman et autobiographie (9-15)\n\nXXème siècle\nrupture avec le roman traditionel\nune histoire d'elle-même ? (*Barrage contre le Pacifique*--elle rencontre un récit de la 3ème personne)\n\nde 67 ans, elle observe sa jeunesse\n(double temporalité) présent et passé (\"il est déjà trop tard\" ; \"j'ai un visage détruit\")\n1. présent de l'écr\n2. présent du roman\n3. passé\n\nsouligner sa situation entre deux âges\ncontraste: 30 v. 15 ans, sociale (riche, non), ethnique (européen, asiatique)\n\"attraper\" le visage comme si c'est une maladie (rapport avec l'alcool)\nmalgré la volonté de sa mère (la former en maths), elle veut devenir écrivaine\n\npériodes claires, cachées\nenfouissements--mise au jour (processus par lequel on fait sortir qqch), alors archéologique"
    }
  ]
}