{
  "title": "31 janv. // Lecture 4",
  "cells": [
    {
      "type": "markdown",
      "data": "__Revue__\n- La première guerre : bouleversement \n- Plusieurs jeunes écrivains morts\n- Lettres (l'hôpital, par ex.)\n- Patriotique ou Critique (c.a.d. plus difficile à publier)\n\n## Continuation\n\n- Le tournant : __Le Feu__ (sous-titre « Journal d'une escouade ») prix Goncourt 1916\n    - Prendre les notes de la guerre\n    - Comment parler de la guerre ?\n    - Pour la première fois, la langue populaire dans l'écriture (l'argot, bouleversement de la syntaxe, dialogues décisives)\n    - Eviter la bourgeosie : rendre la langue des hommes ordinaires\n    - Toutes les classes sociales sont face en face avec la même guerre\n    - La langue est témoins de cette mélange\n    - Démystifier « le héroisme » de la guerre (profondement pacifiste)\n    - S'engager dans la politique communiste\n\n### La poésie\n\n- *Calligrammes*\n- Poèmes de Cendras (*J'ai tué*)\n\n### Conséquences littéraires de la guerre\n\n- antimilitariste et pacifiste\n- *Au-dessus de la mêlée* (Romain Rolland) : condamné et jugé la guerre\n    - La guerre est un suicide de l'Europe\n    - c.a.d. il veut surmonter au-dessus de ce nationalisme\n    - Prix nobel de littérature\n    - Le pacifisme n'est plus tenable : le trahisme\n- __Vie des Martyrs__ (Duhamel)\n- __Civilisation__ : prix Goncourt\n- Après la guerre, __Les Croix de bois__ (Dorgelès) : prix Femina (finaliste 1919 Goncourt)\n    - Pour enterrer les cadavres (croix de bois)\n    - Comment écrire un roman quand tous les personnages principaux meurent\n\n__Dévoloppement du témoignage__\n- Conflit entre littérature et témoignage\n- Est-ce que le travail de mise-en-forme de la dénaturation, ou est-ce une mise-en-forme du récit\n- Débat !\n- Témoignage comme genre lit.\n- Ethique, techniques\n- Cru, Genevoix\n- Lire tout ce qu'il peut de la guerre, établir une fiche pour catégoriser les témoins et les nons\n\n__Guerre débat__ (20s)\n- Pour quelques-uns, la guerre a transformé la vie\n- On soupçonne qqch?\n- Nouvelle génération : surréaliste\n    - Discours de la guerre devient interdit\n    - Jeunes ; ils estime qu'il est temps de *tourner la page*\n    - Baraisse, figure important nationaliste\n    - Les surréalistes utilisent le procès parodique des nationalistes ?\n    - Le marché est saturé de la guerre (deveun de piètre qualité)\n30s\n- Revenir à la guerre du prisme de présent (à partir de présent et ses concernes, ses inquiétudes)\n- Remettre la guerre en perspectif\n- Céline __Voyage au bout de la nuit__ ('32) 1ère personne \n    - Récit des experiences\n    - Mésadventures de Ferdinand Bardemule\n    - Afrique colonial, Etats-Unis\n    - La guerre devient une folie : la seule façon de la résister, c'est la lâcheté\n    - Aucune description de combat, de la vie militaire, mais elle reprend la tragique et la grotesque\n    - La tragique, mais tourné en dérision\n    - Casser le héroise\n    - Le narrateur rencontre une même misère partout\n    - Nouvelle écriture romanesque : chargée de l'oralité, les gros mots, extremement poétique, constant transgression (de point de vue grammatical)\n- __Bagatelles pour un massacre__ (et des autres) : anti-semitisme?\n\n# L'entre-deux-guerres\n\n## Le surréalisme\n\n- Marquant au XXème siècle\n- Révolution la poésie, les essais, la théâtre, &c.\n- Ce n'est non seulement artistique mais aussi une nouvelle conception de vie\n- Un nouveau rapport entre l'homme et le monde\n- André Breton (« Papes » de surréalisme)\n\n### De Dada au surréalisme\n\n- Traumatisme collectif\n- Sentiment que la valeur de la société, tout à ce qu'on a cru avant-guerre est cassé, c'est aussi ça qui a causé les massarcres\n- Tristant Tzara a fondé Dada à Zurich (1916)\n- Position d'exteriorité qui paradoxalement lui permets à ...?\n- FR en 1919\n- Parle du volonté d'une négation radicale (retourner jusqu'aux racines)\n- Nom choisi par hasard dans une dictionnaire précisement parce qu'il signifie rien (et il a aussi un son enfantile)\n- Manifeste : contre tout, retourner complètement au fond, déstruire tout et balayer, nettoyer, contradiction, négation\n- Cracher (spit) sur les idoles et les idéals\n- Tourné vers l'exterieur, vers les espace publique\n- Il n'a pas de sens sans être tourné ver une publique bourgeosie qu'il va choquer et bouleverser\n- Il faut aller dans rues, choquer les bourgeois, poser la négation à tous\n- Subversion systématique des manifestations artistiques et culturelles, sabotage grâce à l'organisation d'événements spectaculaires ; tracts et affiches\n- Faire éclater les images\n- C'est l'hasard qui va constituer le poème, qui va rassembler les morceaux dans un poème\n- Dada et les premiers surréalists va marcher ensemble"
    }
  ]
}