{
  "title": "19 January // Lecture 2",
  "cells": [
    {
      "type": "markdown",
      "data": "#Egypt\n\nCemeteries clustered in western desert along literral\nWest relatively level in elevation\nEast becomes rockier to north\nRavines/other barriers between Nile and Red Sea\n\nWhy did they devote so much time/resources to the mortuary complex (or context)?\nWhat do we really know about the urbanization sphere? (Most in alluvium; few we can see are impressive)\n\nWhole complexes of tombs become state monuments: why did they do that?\nWhy do societies materialize the social and political contexts the way they do?\n\nEgypt in contact with everyone by Old Kingdom (Mesopotamia, Mediterranean)\n\n*Primary States* (appear early, organized, peak of materialization, etc.)\n*Secondary States* (smaller scale, come later, latent, peak of materialization)\n\nHieroglyphic script of Egyptians is early and somewhat unique\n3000 B.C. writing in cumbersome, complex script: glyphs can stand for sounds or objects\nPallet of Narmor\n\nCuneiform in Mesopotamia emerges from an accounting system (circa 4000 B.C.)\n\nAlphabets come later: Semitic invention that spreads through Mediterranean\n\n14th Century: Egyptian begins to work like normal state (military, armies, borders, etc.)\n\n3rd millenium (3000-2000 B.C.) is early Bronze age (roughly corresponds to kingdoms)\nKingdoms, Dynasties because of the documents of royal lineages\nOld (3rd millenium) => break (1st intermediary period) => Middle Kingdom (mid Bronze) => New Kingdom (late Bronze) \n\nMeso/Sumerian cities around same period focus on civic/agriculture/economic structure and temple building (Ziggurats)\n\nMortuary Constructs relatively bizzare, but documents (novels, poetry, &c.) reveal them to be normal (remarkably progressive) people\n\nMemphis (emerges as political capital) near Saqqara\n\nLots of neolithic settlements (also mortuary complexes) North of Fayum\nDon't know densities, but some survived by chance on the ridges of the marsh (didn't get washed away)\n\nBend of river near Abydos from 4000 B.C. on great increase in mortuary activity (late Pre-dynastic)--charged; something happened; epicenter\nNaqada is important as far as development of material culture\nTypical late pre-Dynastic burial: (not mummified) contracted inhumation in a cist tomb; head south facing west; lots of pots; preserved because of natural drying\nProliferation of these burials\nThen increasing differentiation of burial (bigger vs. smaller; more things vs. less; elaborate things vs. not; types) and wealth\nDifferentiation of cemeteries themselves\nBlack-top: black band around top of pot; bright red bottom\nRipple flaked blades (specialization of labor)\nStone pallets\nEvolving Ceramic Production in Naqada (South)... Then later North\nDark on light pottery originate in South, move North\n\n**ALLIGATORS**\n\nNile=source of life\n\nEgypt does not have evidence of early widespread agricultural urbanization, yet becomes agricultural center of Meditteranean\nPossibly because sedentary communities do some agriculture but not a lot--integrated connection with natural environment\nLatent adoption of agriculture may have to do with fertility of Nile\n\n####Old Kingdom\nPeople in remarkable nutrient health\nMost laborers had multiple bone breaks, but properly healed breaks!\nRelatively higher life-expectancy across all strata"
    }
  ]
}